InformationRegisters/ПлановоеЗначениеПроектирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановоеЗначениеПроектирования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончанияВКалендарных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончанияВРабочих</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланРазработкиВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановоеЗначениеПроектирования/Ext/ManagerModule.bsl
Процедура ЗаписатьПлановоеЗначениеЗадачи(Задача, ДатаНачала = Неопределено, ПланРазработкиВДнях = Неопределено, Комментарий = "") Экспорт

	ТД = ТекущаяДата(); 
	
	Если ДатаНачала = Неопределено ИЛИ ПланРазработкиВДнях = Неопределено Тогда
		
		ДатаНачала 			= ТД;
		ПланРазработкиВДнях = 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала КАК ДатаНачала,
			|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
			|ИЗ
			|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних(, Задача = &Задача) КАК ПлановоеЗначениеПроектированияСрезПоследних";
		
		Запрос.УстановитьПараметр("Задача", Задача);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДатаНачала 			= Выборка.ДатаНачала;
			ПланРазработкиВДнях = Выборка.ПланРазработкиВДнях;
		КонецЦикла;
		
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача 					= Задача;
	МенеджерЗаписи.Период 					= ТД;
	МенеджерЗаписи.Автор 					= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.ДатаНачала 				= ДатаНачала;
	МенеджерЗаписи.ПланРазработкиВДнях 		= ПланРазработкиВДнях;                        
	МенеджерЗаписи.ОкончанияВРабочих 		= омДаты.ДобавитьДниСУчетомВыходных(ДатаНачала, ПланРазработкиВДнях);
	МенеджерЗаписи.ОкончанияВКалендарных 	= ДатаНачала + 86400 * ПланРазработкиВДнях;
	МенеджерЗаписи.Комментарий 				= Комментарий;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры
